zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cm_jh/pic32cm_jh01/pic32cm5164jh01100-pinctrl.h
/* pc3a_eic_extint11 */
#define PC3A_EIC_EXTINT11 MCHP_PINMUX(c, 3, a, periph)

/* pc3f_tcc2_wo0 */
#define PC3F_TCC2_WO0 MCHP_PINMUX(c, 3, f, periph)

/* pc5_gpio */
#define PC5_GPIO MCHP_PINMUX(c, 5, gpio, gpio)

/* pc5a_eic_extint13 */
#define PC5A_EIC_EXTINT13 MCHP_PINMUX(c, 5, a, periph)

/* pc5c_sercom6_pad3 */
#define PC5C_SERCOM6_PAD3 MCHP_PINMUX(c, 5, c, periph)

/* pc5f_tcc2_wo1 */
#define PC5F_TCC2_WO1 MCHP_PINMUX(c, 5, f, periph)

/* pc6_gpio */
#define PC6_GPIO MCHP_PINMUX(c, 6, gpio, gpio)

/* pc6a_eic_extint14 */
#define PC6A_EIC_EXTINT14 MCHP_PINMUX(c, 6, a, periph)

/* pc6c_sercom6_pad0 */
#define PC6C_SERCOM6_PAD0 MCHP_PINMUX(c, 6, c, periph)

/* pc7_gpio */
#define PC7_GPIO MCHP_PINMUX(c, 7, gpio, gpio)

/* pc7a_eic_extint15 */
#define PC7A_EIC_EXTINT15 MCHP_PINMUX(c, 7, a, periph)

/* pc7c_sercom6_pad1 */
#define PC7C_SERCOM6_PAD1 MCHP_PINMUX(c, 7, c, periph)

/* pc8_gpio */
#define PC8_GPIO MCHP_PINMUX(c, 8, gpio, gpio)

/* pc8a_eic_extint0 */
#define PC8A_EIC_EXTINT0 MCHP_PINMUX(c, 8, a, periph)

/* pc8c_sercom6_pad0 */
#define PC8C_SERCOM6_PAD0 MCHP_PINMUX(c, 8, c, periph)

/* pc9_gpio */
#define PC9_GPIO MCHP_PINMUX(c, 9, gpio, gpio)

/* pc9a_eic_extint1 */
#define PC9A_EIC_EXTINT1 MCHP_PINMUX(c, 9, a, periph)

/* pc9c_sercom6_pad1 */
#define PC9C_SERCOM6_PAD1 MCHP_PINMUX(c, 9, c, periph)

/* pc10_gpio */
#define PC10_GPIO MCHP_PINMUX(c, 10, gpio, gpio)

/* pc10a_eic_extint2 */
#define PC10A_EIC_EXTINT2 MCHP_PINMUX(c, 10, a, periph)

/* pc10c_sercom6_pad2 */
#define PC10C_SERCOM6_PAD2 MCHP_PINMUX(c, 10, c, periph)

/* pc11_gpio */
#define PC11_GPIO MCHP_PINMUX(c, 11, gpio, gpio)

/* pc11a_eic_extint3 */
#define PC11A_EIC_EXTINT3 MCHP_PINMUX(c, 11, a, periph)

/* pc11c_sercom6_pad3 */
#define PC11C_SERCOM6_PAD3 MCHP_PINMUX(c, 11, c, periph)

/* pc12_gpio */
#define PC12_GPIO MCHP_PINMUX(c, 12, gpio, gpio)

/* pc12a_eic_extint4 */
#define PC12A_EIC_EXTINT4 MCHP_PINMUX(c, 12, a, periph)

/* pc12c_sercom7_pad0 */
#define PC12C_SERCOM7_PAD0 MCHP_PINMUX(c, 12, c, periph)

/* pc13_gpio */
#define PC13_GPIO MCHP_PINMUX(c, 13, gpio, gpio)

/* pc13a_eic_extint5 */
#define PC13A_EIC_EXTINT5 MCHP_PINMUX(c, 13, a, periph)

/* pc13c_sercom7_pad1 */
#define PC13C_SERCOM7_PAD1 MCHP_PINMUX(c, 13, c, periph)

/* pc14_gpio */
#define PC14_GPIO MCHP_PINMUX(c, 14, gpio, gpio)

/* pc14a_eic_extint6 */
#define PC14A_EIC_EXTINT6 MCHP_PINMUX(c, 14, a, periph)

/* pc14c_sercom7_pad2 */
#define PC14C_SERCOM7_PAD2 MCHP_PINMUX(c, 14, c, periph)

/* pc15_gpio */
#define PC15_GPIO MCHP_PINMUX(c, 15, gpio, gpio)

/* pc15a_eic_extint7 */
#define PC15A_EIC_EXTINT7 MCHP_PINMUX(c, 15, a, periph)

/* pc15c_sercom7_pad3 */
#define PC15C_SERCOM7_PAD3 MCHP_PINMUX(c, 15, c, periph)

/* pc16_gpio */
#define PC16_GPIO MCHP_PINMUX(c, 16, gpio, gpio)

/* pc16a_eic_extint8 */
#define PC16A_EIC_EXTINT8 MCHP_PINMUX(c, 16, a, periph)

/* pc16c_sercom6_pad0 */
#define PC16C_SERCOM6_PAD0 MCHP_PINMUX(c, 16, c, periph)

/* pc16d_sercom7_pad0 */
#define PC16D_SERCOM7_PAD0 MCHP_PINMUX(c, 16, d, periph)

/* pc17_gpio */
#define PC17_GPIO MCHP_PINMUX(c, 17, gpio, gpio)

/* pc17a_eic_extint9 */
#define PC17A_EIC_EXTINT9 MCHP_PINMUX(c, 17, a, periph)

/* pc17c_sercom6_pad1 */
#define PC17C_SERCOM6_PAD1 MCHP_PINMUX(c, 17, c, periph)

/* pc17d_sercom7_pad1 */
#define PC17D_SERCOM7_PAD1 MCHP_PINMUX(c, 17, d, periph)

/* pc18_gpio */
#define PC18_GPIO MCHP_PINMUX(c, 18, gpio, gpio)

/* pc18a_eic_extint10 */
#define PC18A_EIC_EXTINT10 MCHP_PINMUX(c, 18, a, periph)

/* pc18c_sercom6_pad2 */
#define PC18C_SERCOM6_PAD2 MCHP_PINMUX(c, 18, c, periph)

/* pc18d_sercom7_pad2 */
#define PC18D_SERCOM7_PAD2 MCHP_PINMUX(c, 18, d, periph)

/* pc19_gpio */
#define PC19_GPIO MCHP_PINMUX(c, 19, gpio, gpio)

/* pc19a_eic_extint11 */
#define PC19A_EIC_EXTINT11 MCHP_PINMUX(c, 19, a, periph)

/* pc19c_sercom6_pad3 */
#define PC19C_SERCOM6_PAD3 MCHP_PINMUX(c, 19, c, periph)

/* pc19d_sercom7_pad3 */
#define PC19D_SERCOM7_PAD3 MCHP_PINMUX(c, 19, d, periph)

/* pc20_gpio */
#define PC20_GPIO MCHP_PINMUX(c, 20, gpio, gpio)

/* pc20a_eic_extint12 */
#define PC20A_EIC_EXTINT12 MCHP_PINMUX(c, 20, a, periph)

/* pc20h_ccl_in9 */
#define PC20H_CCL_IN9 MCHP_PINMUX(c, 20, h, periph)

/* pc21_gpio */
#define PC21_GPIO MCHP_PINMUX(c, 21, gpio, gpio)

/* pc21a_eic_extint13 */
#define PC21A_EIC_EXTINT13 MCHP_PINMUX(c, 21, a, periph)

/* pc21h_ccl_in10 */
#define PC21H_CCL_IN10 MCHP_PINMUX(c, 21, h, periph)

/* pc24_gpio */
#define PC24_GPIO MCHP_PINMUX(c, 24, gpio, gpio)

/* pc24a_eic_extint0 */
#define PC24A_EIC_EXTINT0 MCHP_PINMUX(c, 24, a, periph)

/* pc24c_sercom0_pad2 */
#define PC24C_SERCOM0_PAD2 MCHP_PINMUX(c, 24, c, periph)

/* pc24d_sercom4_pad2 */
#define PC24D_SERCOM4_PAD2 MCHP_PINMUX(c, 24, d, periph)

/* pc25_gpio */
#define PC25_GPIO MCHP_PINMUX(c, 25, gpio, gpio)

/* pc25a_eic_extint1 */
#define PC25A_EIC_EXTINT1 MCHP_PINMUX(c, 25, a, periph)

/* pc25c_sercom0_pad3 */
#define PC25C_SERCOM0_PAD3 MCHP_PINMUX(c, 25, c, periph)

/* pc25d_sercom4_pad3 */
#define PC25D_SERCOM4_PAD3 MCHP_PINMUX(c, 25, d, periph)

/* pc26_gpio */
#define PC26_GPIO MCHP_PINMUX(c, 26, gpio, gpio)

/* pc26a_eic_extint2 */
#define PC26A_EIC_EXTINT2 MCHP_PINMUX(c, 26, a, periph)

/* pc27_gpio */
#define PC27_GPIO MCHP_PINMUX(c, 27, gpio, gpio)

/* pc27a_eic_extint3 */
#define PC27A_EIC_EXTINT3 MCHP_PINMUX(c, 27, a, periph)

/* pc27d_sercom1_pad0 */
#define PC27D_SERCOM1_PAD0 MCHP_PINMUX(c, 27, d, periph)

/* pc27i_ccl_in4 */
#define PC27I_CCL_IN4 MCHP_PINMUX(c, 27, i, periph)

/* pc28_gpio */
#define PC28_GPIO MCHP_PINMUX(c, 28, gpio, gpio)

/* pc28a_eic_extint4 */
#define PC28A_EIC_EXTINT4 MCHP_PINMUX(c, 28, a, periph)

/* pc28d_sercom1_pad1 */
#define PC28D_SERCOM1_PAD1 MCHP_PINMUX(c, 28, d, periph)

/* pc28i_ccl_in5 */
#define PC28I_CCL_IN5 MCHP_PINMUX(c, 28, i, periph)

#endif /* MICROCHIP_PIC32CM5164JH01100_PINCTRL_H_ */
